k,l,m,n = 5,4,4,7

#пункт а
if (((k+l)%2)==((m+n)%2)):
  print("Да, поля (", k, ",", l, ") и (", m, ",", n,") одного цвета.")
else:
  print("Нет, поля (", k, ",", l, ") и (", m, ",", n, ") разного цвета.")

#пункт б
if ((k==l) or (m==n) or (k+l==m+n) or (k-l==m-n)):
  print("Ферзь с поля (", k, ",", l, ") угрожает полю (", m, ",", n, ").")
else:
  print("Ферзь с поля (", k, ",", l, ") не угрожает полю (", m, ",", n, ").")

#пункт в
if (abs(k-m)*abs(l-n)==2):
 print("Конь с поля (", k, ",", l, ") угрожает полю (", m, ",", n, ").")
else:
  print("Конь с поля (", k, ",", l, ") не угрожает полю (", m, ",", n, ").")

#пункт г
if ((k==m) or (l==n)):
  print("Можно одним ходом ладьи попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  print("Можно за два хода ладьи попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", m, ",", l, ").")

#пункт д
if ((k==m) or (l==n) or (k+l==m+n) or (k-l==m-n)):
  print("Можно одним ходом ферзя попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  print("Можно за два хода ферзя попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", k, ",", n, ").")

#пункт е
if (((k+l)%2)!=((m+n)%2)):
  print("Ход невозможен. поля (", k, ",", n, ") и (", m, ",", l, ") разных цветов.")
elif ((k+l==m+n) or (k-l==m-n)):
  print("Можно одним ходом слона попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  p = (k+l-m+n)//2
  q = (k+l+m-n)//2
  if ((p>8) or (p<1) or (q>8) or (q<1)):
    p = (m+n-k+l)//2
    q = (m+n+k-l)//2
  print("Можно за два хода слона попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", p, ",", q, ").")
