i = 0 # счетчик для цикла
print("(k, l) и (m, n) - координаты двух полей шахматной доски от 1 до 8.")
coordinates = ["k", "l", "m", "n"]
coor = [] # список для введенных значений
# цикл для ввода и проверки значений пользователя
while i < 4:
  try:
    s = int(input("Введите %s: " % coordinates[i]))
    if (s < 1) or (s > 8):
      raise ValueError()
    i += 1
    coor.append(s)
  except ValueError:
    print("Неправильное значение!")
# присваивание значений переменным
k, l, m, n = coor[0], coor[1], coor[2], coor[3]
print("Введенные поля: (", k, ",", l, ") и (", m, ",", n,").\n")

print("Ответы:")
# пункт а
# проверка на одинковый цвет полей
if (((k+l)%2)==((m+n)%2)):
  print("Поля (", k, ",", l, ") и (", m, ",", n,") одного цвета.")
else:
  print("Поля (", k, ",", l, ") и (", m, ",", n, ") разного цвета.")
print()

# пункт б
# проверка на угрозу ферзём
if ((k==l) or (m==n) or (k+l==m+n) or (k-l==m-n)):
  print("Ферзь с поля (", k, ",", l, ") угрожает полю (", m, ",", n, ").")
else:
  print("Ферзь с поля (", k, ",", l, ") не угрожает полю (", m, ",", n, ").")
print()

# пункт в
# проверка на угрозу конём
if (abs(k-m)*abs(l-n)==2):
 print("Конь с поля (", k, ",", l, ") угрожает полю (", m, ",", n, ").")
else:
  print("Конь с поля (", k, ",", l, ") не угрожает полю (", m, ",", n, ").")
print()

# пункт г
# проверка на доступность второго поля для ладьи
if ((k==m) or (l==n)):
  print("Можно одним ходом ладьи попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  print("Можно за два хода ладьи попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", m, ",", l, ").")
print()

# пункт д
# проверка на доступность второго поля для ферзя
if ((k==m) or (l==n) or (k+l==m+n) or (k-l==m-n)):
  print("Можно одним ходом ферзя попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  print("Можно за два хода ферзя попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", k, ",", n, ").")
print()

# пункт е
# проверка на доступность второго поля для слона
if (((k+l)%2)!=((m+n)%2)):
  print("Ход невозможен. поля (", k, ",", n, ") и (", m, ",", l, ") разных цветов.")
elif ((k+l==m+n) or (k-l==m-n)):
  print("Можно одним ходом слона попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
else:
  p = (k+l-m+n)//2
  q = (k+l+m-n)//2
  if ((p>8) or (p<1) or (q>8) or (q<1)):
    p = (m+n-k+l)//2
    q = (m+n+k-l)//2
  print("Можно за два хода слона попасть с поля (", k, ",", l, ") на поле (", m, ",", n, ").")
  print("Промежуточный ход на поле (", p, ",", q, ").")
